{
  "products": [
    {
      "id": 1,
      "name": "Grand Theft Auto 5",
      "short_description": "Action-adventure game with a story mode and a multiplayer mode",
      "description": "Experience Rockstar Games' critically acclaimed open world game, Grand Theft Auto V.\n\nWhen a young street hustler, a retired bank robber and a terrifying psychopath find themselves entangled with some of the most frightening and deranged elements of the criminal underworld, the U.S. government and the entertainment industry, they must pull off a series of dangerous heists to survive in a ruthless city in which they can trust nobody, least of all each other.\nExplore the stunning world of Los Santos and Blaine County in the ultimate Grand Theft Auto V experience, featuring a range of technical upgrades and enhancements for new and returning players. In addition to increased draw distances and higher resolution, players can expect a range of additions and improvements including:\n\n• New weapons, vehicles and activities\n• Additional wildlife\n• Denser traffic\n• New foliage system\n• Enhanced damage and weather effects, and much more\n\nGrand Theft Auto V also comes with Grand Theft Auto Online, the dynamic and ever-evolving online universe for up to 30 players, and includes all existing gameplay upgrades and content released since the launch of Grand Theft Auto Online. Rise through the ranks to become a CEO of your own criminal empire by trading contraband or form a Motorcycle Club and rule the streets. Pull off daring co-operative Heists, enter adrenaline-fuelled Stunt Races, compete in unique Adversary Modes or create your own content to play and share with the entire GTA community.",
      "long_description": "Explore Los Santos and Blaine County in greater detail than ever before, now featuring:\n\nSTUNNING VISUALS — Enhanced levels of fidelity and performance with new graphics modes featuring up to 4K resolution, up to 60 frames per second, HDR options, ray tracing, improved texture quality, and more.\n\nFASTER LOADING — Quicker access to the action as the world of Los Santos and Blaine County load in faster than ever before.\n\nSPATIAL SOUND — Hear the sounds of the world with pinpoint precision: the throttle of a stolen supercar, the rattle of neighboring gunfire, the roar of a helicopter overhead, and more.\n\nPlus, all-new enhancements to the ever-evolving world of GTA Online, including:\n\nEXCLUSIVE NEW CONTENT — Step into Hao’s Special Works at the Los Santos Car Meet, featuring elite new upgrades and exclusive modifications. Then take these high-performance vehicles into HSW races, new time trials, and more.\n\nTHE CAREER BUILDER — Get started in GTA Online with the tools of the trade. Quickly choose from one of four businesses — Biker, Executive, Nightclub Owner, or Gunrunner — and select from properties, powerhouse vehicles, and weaponry to kick-start your enterprise.\n\nNEW MENU DESIGN — Immediately access everything GTA Online has to offer right from the Main Menu, including the latest and most popular updates.\n\nACCESS TO ALL CURRENT AND PREVIOUS UPDATES — Dive into more than 40 massive updates with more to come, featuring everything from the high-stakes hunt for Dr. Dre’s missing music files with Franklin Clinton in The Contract to the high-octane underground street racing action of Los Santos Tuners; Heists on the lush tropical island of Cayo Perico to the nightlife circuit of After Hours and The Diamond Casino & Resort; all available alongside a wide range of races, modes, activities, and social spaces to enjoy solo or with friends — including golf courses, nightclubs, arcades, poolside lounges, and much more.",
      "developer": "Rockstar Games",
      "price": 52.5,
      "image": "https://upload.wikimedia.org/wikipedia/en/a/a5/Grand_Theft_Auto_V.png",
      "platform": "PC",
      "age_rating": "18+",
      "release_date": "12/04/2022",
      "rating": 3.2,
      "review_count": 936
    },
    {
      "id": 2,
      "name": "The Crew 2",
      "short_description": "Motoring, open world, racing game with multiplayer",
      "description": "Ready to show your talent across multiple motorsports? Rise to the occasion and discover America in a whole new way. Choose how you discover this exhilarating open world where you must put your skills to the test in each types of transport!\n\nEnjoy the freedom of exploring where you want, when you want and how you want. You can seamlessly switch between a variety of cars, bikes, boats and planes so you can soar through the sky of San Francisco and then race high-speed through Los Angeles!",
      "long_description": "Explore the coasts, beaches and skylines of America in a variety of different ways. Seamlessly choose the way you explore the open-world of The Crew 2 on PlayStation 4 and swap between cars, planes, boats, bikes and more. There’s so many ways to discover the exhilarating open-world and plenty of events and challenges to complete.\n\nAmerica is known as the land of opportunity and in The Crew 2 you can experience this opportunity and more. Explore from coast to coast as you adventure through the stunning beaches, vibrant cities, incredible landscapes and more with plenty of freedom.\n\nSay hello to the lady in green in the incredible New York City, bask on the beaches and admire Los Angeles as the sun goes down or head downtown to the vibrant and lively Miami. Whether you want to race around corners in a high-speed car or soar through the skies in one of the many planes, the opportunities are endless. What a better place to explore than United State of America?",
      "developer": "Ubisoft",
      "price": 31.99,
      "image": "https://m.media-amazon.com/images/I/91aI00z5SrL._AC_SL1500_.jpg",
      "platform": "Playstation",
      "age_rating": "12+",
      "release_date": "29/06/2018",
      "rating": 4.5,
      "review_count": 1298
    }
  ],
  "reviews": [
    {
      "id": 1,
      "product_id": 1,
      "name": "Ed Fisk",
      "date": "10/02/2011",
      "ratings": {
        "gameplay": 9,
        "social": 3,
        "graphics": 8,
        "value": 5,
        "overall": 7
      },
      "comments": {
        "positive": "Great game!",
        "negative": "It takes a while to download"
      }
    },
    {
      "id": 1,
      "product_id": 1,
      "name": "Ed Fisk",
      "date": "10/02/2011",
      "ratings": {
        "gameplay": 9,
        "social": 3,
        "graphics": 8,
        "value": 5,
        "overall": 7
      },
      "comments": {
        "positive": "Great game!",
        "negative": "It takes a while to download"
      }
    },
    {
      "id": 1,
      "product_id": 1,
      "name": "Ed Fisk",
      "date": "10/02/2011",
      "ratings": {
        "gameplay": 9,
        "social": 3,
        "graphics": 8,
        "value": 5,
        "overall": 7
      },
      "comments": {
        "positive": "Great game!",
        "negative": "It takes a while to download"
      }
    },
    {
      "id": 2,
      "product_id": 2,
      "name": "Ed Fisk",
      "date": "10/02/2011",
      "ratings": {
        "gameplay": 9,
        "social": 3,
        "graphics": 8,
        "value": 5,
        "overall": 7
      },
      "comments": {
        "positive": "Great game!",
        "negative": "It takes a while to download"
      }
    }
  ]
}
